issue754/test1/proxy130_thr128.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            7288434
        write:                           0
        other:                           0
        total:                           7288434
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 7288434 (121412.95 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0301s
    total number of events:              134971
    total time taken by event execution: 7682.2619s
    response time:
         min:                                  8.56ms
         avg:                                 56.92ms
         max:                                361.42ms
         approx.  95 percentile:              99.23ms

Threads fairness:
    events (avg/stddev):           1054.4609/75.27
    execution time (avg/stddev):   60.0177/0.01