issue754/test1/proxy130_thr16.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            4796928
        write:                           0
        other:                           0
        total:                           4796928
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 4796928 (79933.99 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0111s
    total number of events:              88832
    total time taken by event execution: 960.0294s
    response time:
         min:                                  8.45ms
         avg:                                 10.81ms
         max:                                349.42ms
         approx.  95 percentile:              10.10ms

Threads fairness:
    events (avg/stddev):           5552.0000/31.90
    execution time (avg/stddev):   60.0018/0.00