issue754/test1/proxy130_thr16.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            4854060
        write:                           0
        other:                           0
        total:                           4854060
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 4854060 (80888.27 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0094s
    total number of events:              89890
    total time taken by event execution: 959.9975s
    response time:
         min:                                  8.32ms
         avg:                                 10.68ms
         max:                                361.62ms
         approx.  95 percentile:              10.32ms

Threads fairness:
    events (avg/stddev):           5618.1250/114.91
    execution time (avg/stddev):   59.9998/0.00