issue754/test1/proxy130_thr256.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            6435936
        write:                           0
        other:                           0
        total:                           6435936
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 6435936 (107143.15 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0686s
    total number of events:              119184
    total time taken by event execution: 15371.1302s
    response time:
         min:                                  8.63ms
         avg:                                128.97ms
         max:                                553.67ms
         approx.  95 percentile:             225.88ms

Threads fairness:
    events (avg/stddev):           465.5625/122.97
    execution time (avg/stddev):   60.0435/0.02