issue754/test1/proxy130_thr256.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            12462714
        write:                           0
        other:                           0
        total:                           12462714
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 12462714 (207586.18 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0363s
    total number of events:              230791
    total time taken by event execution: 15365.0951s
    response time:
         min:                                 17.44ms
         avg:                                 66.58ms
         max:                                388.32ms
         approx.  95 percentile:             120.83ms

Threads fairness:
    events (avg/stddev):           901.5273/41.67
    execution time (avg/stddev):   60.0199/0.01