issue754/test1/proxy130_thr32.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8079426
        write:                           0
        other:                           0
        total:                           8079426
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8079426 (134635.17 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0098s
    total number of events:              149619
    total time taken by event execution: 1920.0348s
    response time:
         min:                                  8.06ms
         avg:                                 12.83ms
         max:                                379.63ms
         approx.  95 percentile:              13.79ms

Threads fairness:
    events (avg/stddev):           4675.5938/42.87
    execution time (avg/stddev):   60.0011/0.00