issue754/test1/proxy130_thr32.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8205354
        write:                           0
        other:                           0
        total:                           8205354
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8205354 (136731.53 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0107s
    total number of events:              151951
    total time taken by event execution: 1920.0725s
    response time:
         min:                                  8.20ms
         avg:                                 12.64ms
         max:                                370.79ms
         approx.  95 percentile:              12.78ms

Threads fairness:
    events (avg/stddev):           4748.4688/184.19
    execution time (avg/stddev):   60.0023/0.00