issue754/test1/proxy130_thr512.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            10378098
        write:                           0
        other:                           0
        total:                           10378098
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 10378098 (172740.68 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0791s
    total number of events:              192187
    total time taken by event execution: 30742.9972s
    response time:
         min:                                 26.41ms
         avg:                                159.96ms
         max:                                610.24ms
         approx.  95 percentile:             249.11ms

Threads fairness:
    events (avg/stddev):           375.3652/9.27
    execution time (avg/stddev):   60.0449/0.02