issue754/test1/proxy130_thr512.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            5598072
        write:                           0
        other:                           0
        total:                           5598072
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 5598072 (92988.85 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2015s
    total number of events:              103668
    total time taken by event execution: 30782.8960s
    response time:
         min:                                  8.69ms
         avg:                                296.94ms
         max:                                866.11ms
         approx.  95 percentile:             474.27ms

Threads fairness:
    events (avg/stddev):           202.4766/227.38
    execution time (avg/stddev):   60.1228/0.06