issue754/test1/proxy130_thr64.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            7415118
        write:                           0
        other:                           0
        total:                           7415118
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 7415118 (123171.70 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2015s
    total number of events:              137317
    total time taken by event execution: 3846.0572s
    response time:
         min:                                  8.37ms
         avg:                                 28.01ms
         max:                                395.16ms
         approx.  95 percentile:              37.41ms

Threads fairness:
    events (avg/stddev):           2145.5781/72.41
    execution time (avg/stddev):   60.0946/0.08