issue754/test1/proxy130_thr64.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            11830158
        write:                           0
        other:                           0
        total:                           11830158
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 11830158 (197123.54 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0139s
    total number of events:              219077
    total time taken by event execution: 3840.2892s
    response time:
         min:                                  9.25ms
         avg:                                 17.53ms
         max:                                369.61ms
         approx.  95 percentile:              19.48ms

Threads fairness:
    events (avg/stddev):           3423.0781/177.58
    execution time (avg/stddev):   60.0045/0.00